[{"id":"computer_network","english":"Computer network","englishLink":"https://en.wikipedia.org/wiki/Computer_network","finnishLink":"https://fi.wikipedia.org/wiki/Tietokoneverkko","finnish":"Tietokoneverkko","definition":"Tietokoneverkko tai tietoverkko koostuu joukosta tietokoneita jotka jakavat resursseja tietoverkon avulla. Tietoverkossa on myös verkkolaitteita ja niitä yhdistäviä kommunikointilinkkejä.\n\nTietokoneet ja verkkolaitteet (solmu, *node*) käyttävät useita eri tietoliikenneprotokollia kommunikoinnissa. Laitteita yhdistävät linkit on toteutettu joko fyysisin kaapelein (kupari, optinen kaapeli) tai radiolinkein. Verkon solmut voivat olla verkkolaitteiden lisäksi henkilökohtaisia tietokoneita, palvelimia, älypuhelimia tai muita yleiskäyttöisiä tai tiettyyn rajoitettuun käyttöön suunniteltuja laitteita. Jokaisella verkkoon kytketyllä laitteella on verkko-osoite, jonka avulla laitteen kanssa voi kommunikoida ja se voidaan tunnistaa."},{"id":"internet","english":"Internet","englishLink":"https://en.wikipedia.org/wiki/Internet","finnishLink":"https://fi.wikipedia.org/wiki/Internet","finnish":"Internet","definition":"Internet (tai pienellä internet) on maailmanlaajuinen toisiinsa liittyvien tietoverkkojen muodostama verkko (*inter-connected networks*) joka käyttää Internetin protokollia (TCP/IP) ja yhteisesti sovittuja käytäntöjä verkkolaitteiden ja tietokoneiden välisessä tietoliikenteessä.\n\nVerkot voivat olla yksityisiä, julkisia, akateemisia, yritysverkkoja ja viranomaisten hallitsemia paikallisia tai laajempiakin verkkoja.\n\nInternetissä sijaitsee laaja määrä erilaisia resursseja ja palveluita. Esimerkkeinä hypertekstidokumentit, sähköposti, internet -puhelut ja tiedostojen jakaminen. Internetin historia liittyy pakettikytkentäisten verkkojen kehittämiseen 1970 -luvulla, liittyen USA:n puolustushallinnon ARPANET -verkkoon."},{"id":"internet_protocol_suite","english":"Internet Protocol Suite","englishLink":"https://en.wikipedia.org/wiki/Internet_protocol_suite","finnishLink":"https://fi.wikipedia.org/wiki/TCP/IP","finnish":"Internet -protokollaperhe (TCP/IP)","definition":"Internet -protokollaperhe joka tunnetaan myös nimellä TCP/IP, on joukko kommunikointiprotokollia joita käytetään Internetissä ja muissa vastaavissa tietoverkoissa. Tärkeimmät protokollat ovat Transmission Control Protocol (TCP), Internet Protocol (IP) sekä User Datagram Protocol (UDP).\n\nProtokollat kuvaavat kuinka data paketoidaan, verkko-osoitteita käytetään, data lähetetään ja reititetään sekä vastaanotetaan. Toiminnallisuus on jaettu neljään abstraktiotasoon, jonka takia puhutaankin usein protokollapinosta. Tasot ovat (alhaalta ylös) linkkitaso, verkkotaso, siirtotaso ja sovellustaso. Protokollien standardeja ylläpitää Internet Engineering Task Force (IETF)."},{"id":"host_system","english":"Host","englishLink":"https://en.wikipedia.org/wiki/Host_(network)","finnishLink":"","finnish":"Isäntäkone","definition":"Isäntäkone on tietokone tai muu tietotekninen laite joka on yhdistetty tietoverkkoon. Isäntäkone voi olla myös palvelin joka tarjoaa palveluita, tietoa ja/tai sovelluksia toisille isäntäkoneille verkossa. Isäntäkoneilla on ainakin yksi osoite verkossa.\n\nTietokonetta, joka on nimenomaan Internet -protokollapinon mukaisessa verkossa, voidaan kutsua myös Internet -isäntäkoneeksi. Näillä on yksi tai useampia IP -osoitteita. Isäntäkone saa osoitteensa joko käsin asetettuna, automaattisesti konfiguroituna tai käyttäen esimerkiksi protokollaa nimeltä Dynamic Host Configuration Protocol (DHCP)."},{"id":"server","english":"Server","englishLink":"https://en.wikipedia.org/wiki/Server_(computing)","finnishLink":"https://fi.wikipedia.org/wiki/Palvelin","finnish":"Palvelin","definition":"Palvelin (\"serveri\") on tietokone ja/tai ohjelmia joka tarjoaa palveluita muille tietokoneille tai ohjelmille, asiakkaille (*client*). Tällaista arkkitehtuuria kutsutaan asiakas-palvelin -arkkitehtuuriksi (*client-server architecture*).\n\nYksi palvelin voi palvella useampaa asiakasta, ja yksi asiakas voi myös käyttää useamman palvelimen palveluita. Joskus asiakas ja palvelin voivat olla myös samassa tietokoneessa.\n\nPalveluita ovat esimerkiksi tietokanta-, sähköposti-, tulostus-,  peli- tai webbipalveluita."},{"id":"client","english":"Client","englishLink":"https://en.wikipedia.org/wiki/Client_(computing)","finnishLink":"","finnish":"Asiakas","definition":"Asiakas (tai asiakasohjelma) on tietokonelaitteisto ja/tai ohjelma, joka käyttää hyödykseen palvelimen tarjoamia palveluita. Usein (muttei aina) palvelin on toisessä isäntäkoneessa, jolloin palvelua käytetään tietoverkon yli.\n\nAsiakas lähettää palvelupyyntöjä palvelimelle, joka odottaa palvelupyyntöjä asiakkailta. Palvelin käsittelee pyynnön ja vastaa asiakkaalle kun palvelu on suoritettu. Esimerkiksi verkkoselain on asiakasohjelma joka lähettää palvelupyyntöjä webbipalvelimelle joka vastaa verkkosivulla jonka selain näyttää käyttäjälle.\n\nYhdessä asiakas ja palvelin muodostavat asiakas-palvelin -arkkitehtuuurin joka on yksi tapa rakentaa verkkoon hajautettuja tietojärjestelmiä."},{"id":"network_node","english":"Node","englishLink":"https://en.wikipedia.org/wiki/Node_(networking)","finnishLink":"https://fi.wikipedia.org/wiki/Solmu_(tietojenkäsittelytiede)","finnish":"Solmu","definition":"Solmu on joko verkossa oleva isäntäkone tai joku verkon laitteista joka välittää liikennettä muista verkon solmuista toisiin verkon solmuihin.\n\nTietoverkoissa liikennettä välittäviä solmuja ovat esimerkiksi modeemi, reititin, silta tai kytkin. Isäntälaitteita ovat esimerkiksi digitaalinen puhelin, kännykkä, tulostin tai tietokone."},{"id":"router","english":"Router","englishLink":"https://en.wikipedia.org/wiki/Router_(computing)","finnishLink":"https://fi.wikipedia.org/wiki/Reititin","finnish":"Reititin","definition":"Reititin on verkkolaite joka välittää datapaketteja tietoverkkojen välillä.\n\nPakettivälitteisissä verkoissa (kuten Internet) paketti liikkuu reitittimeltä toiselle tyypillisesti useiden verkkojen kautta kunnes se päätyy solmuun jonne paketti on osoitettu.\n\nReititin on kytketty datalinkeillä kahteen tai useampaan IP -verkkoon. Kun paketti saapuu reitittimeen yhtä linkkiä pitkin, reititin lukee paketin otsikkotiedoista sen kohdesolmun osoitteen. Reititin katsoo osoitetiedon avulla reititystaulustaan mihin uloslähtevistä linkeistä paketti pitäisi lähettää."},{"id":"network_switch","english":"Network switch","englishLink":"https://en.wikipedia.org/wiki/Network_switch","finnishLink":"https://fi.wikipedia.org/wiki/Kytkin_(tietoliikenne)","finnish":"Kytkin","definition":"Kytkin on pakettikytkentäisessä tietoverkossa laite joka yhdistää verkon osia *linkkitasolla* (taso 2).\n\nLaite vastaanottaa paketteja ja välittää niitä laitteiden MAC -osoitteita käyttäen seuraavalle laitteelle.\n\nJotkut kytkimet välittävät paketteja myös verkon tasolla 3 (*verkkotaso*), jolloin niitä kutsutaan usein nimellä reititin.\n\nKytkin eroaa keskittimestä siten että keskittimet (hub) välittävät paketteja joka suuntaan. Kytkin taas havaitsee minkä kaapelin (linkin) päässä on tietty vastaanottaja tietyllä MAC -osoitteella ja välittää tälle kuuluvat paketit vain tähän linkkiin."},{"id":"modem","english":"Modem","englishLink":"https://en.wikipedia.org/wiki/Modem","finnishLink":"https://fi.wikipedia.org/wiki/Modeemi","finnish":"Modeemi","definition":"Termi modeemi tulee sanoista modulaattori/demodulaattori. Modeemin tehtävänä on muuntaa (moduloida) digitaalisessa muodossa oleva data analogiseen muotoon lähettämistä varten jotain fyysistä linkkiä pitkin.\n\nSamalla tavalla vastaanottava modeemi muuntaa (demoduloi) analogisen signaalin digitaaliseksi dataksi. Fyysinen kanava voi olla esimerkiksi valokaapeli, puhelinlinja tai radioaallot.\n\nYksittäisessä laitteessa voi olla useampikin modeemi joka tukee eri tyypisen linkin kautta tapahtuvaa kommunikointia."},{"id":"base_station","english":"Base station","englishLink":"https://en.wikipedia.org/wiki/Base_station","finnishLink":"https://fi.wikipedia.org/wiki/Tukiasema","finnish":"Tukiasema","definition":"Tukiasema liittyy langattomaan tiedonsiirtoon. Tukiasema on radiolähetin ja -vastaanotin joka toimii paikallisverkon muodostajana sen kautta kommunikoiville laitteille.\n\nUsein se toimii myös yhdyskäytävänä (*gateway*) langattomasta verkosta toiseen verkkoon. Esimerkiksi kotona oleva langaton tukiasema kytkeytyy operaattorin verkkoon, joko lankaverkon tai 4/5G -verkon kautta. Tukiasema sisältää tyypillisesti reitittimen joka osaa reitittää liikennettä lähiverkon ja ulkopuolisen (kotona operaattorin) verkon välillä."},{"id":"gateway","english":"Gateway","englishLink":"https://en.wikipedia.org/wiki/Gateway_(telecommunications)","finnishLink":"https://fi.wikipedia.org/wiki/Yhdyskäytävä","finnish":"Yhdyskäytävä","definition":"Yhdyskäytävä on laite ja/tai ohjelmisto, joka mahdollistaa tiedon siirtämisen verkosta toiseen.\n\nYhdyskäytävä eroaa reitittimestä ja kytkimestä siinä että yhdyskäytävät tukevat useampia protokollia eri tyyppisten verkkojen välillä ja voivat toimia kaikilla verkon tasoilla. Reititintä (*router*) voidaan pitää yhdyskäytävän  rajoittuneena erikoistapauksena."},{"id":"network_packet","english":"Network packet","englishLink":"https://en.wikipedia.org/wiki/Network_packet","finnishLink":"https://fi.wikipedia.org/wiki/Verkkopaketti","finnish":"Verkkopaketti","definition":"Verkkopaketti on datan yksikkö jota siirretään pakettikytkentäisissä verkoissa. Paketti sisältää varsinaisen siirrettävän datan (*payload*) lisäksi kontrolli-informaatiota.\n\nKontrolli-informaatio sisältyy paketin otsikkotietoihin (*packet header, trailer*). Otsikkotietoja ovat esimerkiksi paketin lähtö- ja kohdelaitteiden osoitteet, virheenhavaitsemista varten erilaisia koodeja, ja pakettien järjestysnumeroita."},{"id":"packet_switching","english":"Packet switching","englishLink":"https://en.wikipedia.org/wiki/Packet_switching","finnishLink":"https://fi.wikipedia.org/wiki/Pakettikytkentä","finnish":"Pakettikytkentä","definition":"Pakettikytkentäisissä tietoverkoissa lähetettävä data ryhmitellään paketeiksi joita lähtetään tietoverkon yli määränpäästä kohteeseen.\n\nPaketti koostuu otsikkotiedoista ja lähetettävän datan osista. Verkon laitteet (reitittimet ja kytkimet) käyttävät otsikkotietoja pakettien reitittämiseen ja siirtämiseen verkossa, sekä esimerkiksi virheiden tarkistamiseen.\n\nVerkon kapasiteettia jaetaan siten että usea isäntäkoneen istunto (*session*) voi samanaikaisesti lähettää ja vastaanottaa dataa verkosta.\n\nVastakohtana *piirikytkentäinen* verkko, jossa verkon kapasiteetti varataan tiedonsiirron ajaksi ja tieto siirtyy pakettien sijaan jatkuvana bittivirtana."},{"id":"protocol","english":"Protocol","englishLink":"https://en.wikipedia.org/wiki/Communication_protocol","finnishLink":"https://fi.wikipedia.org/wiki/Protokolla_(tietoliikenne)","finnish":"Protokolla","definition":"Tietoliikenneprotokolla eli yhteyskäytäntö on sääntöjen kokoelma, joka mahdollistaa sen että kaksi tai useampaa entiteettiä voi siirtää informaatiota erilaisten fyysisten kommunikaatiolinkkien kautta.\n\nProtokolla määrittelee kommunikoinnin säännöt, syntaksin, semantiikan ja synkronointimekanismit, sekä virheistä toipumisen menetelmät. Protokolla voidaan toteuttaa joko laitteistolla, ohjelmistolla tai molemmilla.\n\nKättely (*handshake*) on yksinkertainen protokolla jossa laitteet tai ohjelmistot sopivat siitä miten tiedonsiirtoa tai laitteiden välistä yhteistoimintaa aiotaan jatkossa hoitaa."},{"id":"peer_to_peer","english":"Peer to Peer (P2P)","englishLink":"https://en.wikipedia.org/wiki/Peer-to-peer","finnishLink":"https://fi.wikipedia.org/wiki/Vertaisverkko","finnish":"Vertaisverkko","definition":"Vertaisverkko on hajautettujen sovellusten arkkitehtuuri jossa isäntäkoneet yhdessä jakavat suoritettavia tehtäviä ja dataa tasaveroisesti. Toisin kuin asiakas-palvelinverkossa, jossa asiakkailla ja palvelimella on toisistaan selkeästi erilaiset roolit.\n\nVertaisverkossa isäntäkoneet antavat resursseistaan, kuten prosessointitehosta, siirtokapasiteetista tai levytilasta tietyn osuuden muille vertaisverkon jäsenille. Mitään keskeistä resurssia kuten palvelin ei välttämättä tarvita. Vertaiset sekä tarjoavat resursseja muille että käyttävät muiden tarjoamia resursseja.\n\nVertaisverkot tulivat tunnetuksi tiedostonjakopalveluiden kuten Napster myötä."},{"id":"vpn","english":"Virtual Private Network (VPN)","englishLink":"https://en.wikipedia.org/wiki/Virtual_private_network","finnishLink":"https://fi.wikipedia.org/wiki/VPN","finnish":"Virtuaalinen erillisverkko","definition":"Virtuaalinen erillisverkko laajentaa yksityistä verkkoa julkisten verkkojen yli. Näin mahdollistetaan tiedonsiirto ihan kuin se tapahtuisi koko ajan yksityisen verkon sisällä.\n\nEtuna on yksityisten verkkojen suojaaminen ja pääsy yksityisen verkon palveluihin julkisten verkkojen yli. Tyypillinen käyttötarve on etätyöskentely. Tyypillisesti tiedonsiirto VPN:ssa on salattua, vaikka salaus ole VPN-yhteyteen sinänsä sisäänrakennettuna.\n\nVPN -yhteys luodaan joko tätä varten tehdyillä piireillä tai ns. tunnelointiprotokollilla."},{"id":"routing","english":"Routing","englishLink":"https://en.wikipedia.org/wiki/Routing","finnishLink":"https://fi.wikipedia.org/wiki/Reititys","finnish":"Reititys","definition":"Reititys on prosessi jolla pakettikytkentäisissä verkoissa valitaan reitti (*route*) eri verkkojen kautta, muodostaen polun (*path*) jota pitkin paketteja välitetään eteenpäin lähettäjältä vastaanottajalle.\n\nVerkkolaitteet lähettävät paketteja eteenpäin seuraaville verkon solmuille (reitittimet, kytkimet, yhdyskäytävät, jne.) pakettien osoitetietojen mukaisesti. Reititys tapahtuu reititystaulukkojen avulla. Reititystaulukoissa kuvataan mihin verkkolaitteelta lähteviin linkkeihin mihinkin osoitteeseen menevät paketit pitäisi lähettää. Reititysprotokollat ylläpitävät reititystaulukoita dynaamisesti. Taulukot voidaan myös määritellä käsin."},{"id":"network_delay","english":"Network delay","englishLink":"https://en.wikipedia.org/wiki/Network_delay","finnishLink":"https://fi.wikipedia.org/wiki/Latenssi","finnish":"Verkkoviive","definition":"Verkkoviive kuvaa pakettikytkentäisissä verkoissa sitä aikaa joka menee viestin lähettämiseen lähtösolmusta määränpääsolmuun.\n\nViive vaihtelee sen mukaan mistä mihin viesti lähetetään, koska eri isäntäkoneiden välillä on eri määrä verkkolaitteita ja eri teknologioilla rakennettuja linkkejä. Myös verkon ja verkkolaitteiden kuormitus vaikuttaa viiveeseen joka siten riippuu myös ajan hetkestä ja reitistä jota pitkin paketteja siirretään.\n\nYksittäisen verkkolaitteen viiveitä ovat pakettien 1) prosessointiviive, 2) jonotusviive, 3) lähetysviive ja 4) toimitusviive. Se viive jonka käyttäjät havaitsevat, muodostuu näiden viiveiden summasta lähettävän ja vastaanottavan isäntäkoneiden välillä. Tätä (ja muitakin) viivettä kutsutaan myös latenssiksi (*latency*)."},{"id":"packet_loss","english":"Packet loss","englishLink":"https://en.wikipedia.org/wiki/Packet_loss","finnishLink":"","finnish":"Pakettihäviö","definition":"Pakettihäviötä tapahtuu kun yksi tai useampi paketti häviää matkalla pakettikytkentäisessä verkossa eikä pääse määränpäähänsä.\n\nHäviöt johtuvat usein virheistä tiedonsiirrossa, tai ruuhkaisissa verkoissa. Erityisesti langattomissa verkoissa voi tapahtua virheitä siirrossa.\n\nTCP -protokolla tunnistaa pakettien häviämisen ja lähettää paketteja uudelleen (*retransmission*) luotettavan tiedonsiirron mahdollistamiseksi. TCP -protokolla voi myös pienentää tiedonsiirron tahtia (*congestion control*) ruuhkatilanteissa pakettihäviön vähentämiseksi."},{"id":"application_layer","english":"Application layer","englishLink":"https://en.wikipedia.org/wiki/Application_layer","finnishLink":"https://fi.wikipedia.org/wiki/TCP/IP-viitemalli#Sovelluskerros_(Application_Layer)","finnish":"Sovellustaso","definition":"Sovellustaso tai -kerros on Internetin abstraktiotaso joka määrittelee protokollia joilla isäntäkoneiden prosessit kommunikoivat keskenään Internet -protokollan (IP) yli.\n\nSovellustason protokollat rakentuvat alempana olevan siirtotason (*transport layer*) päälle, joka muodostaa varsinaisen isäntäkoneiden välisen tiedonsiirtokanavan.\n\nEsimerkkejä sovellustason protokollista ovat DHCP (verkonhallintaprotokolla), DNS (nimeämisjärjestelmä), HTTP (hypertekstin siirtoprotokolla), SMTP (sähköpostin lähetysprotokolla) ja FTP (tiedostojen siirtoprotokolla)."},{"id":"transport_layer","english":"Transport layer","englishLink":"https://en.wikipedia.org/wiki/Transport_layer","finnishLink":"https://fi.wikipedia.org/wiki/TCP/IP-viitemalli#Kuljetuskerros_(Transport_Layer)","finnish":"Siirtotaso","definition":"Siirtotaso tai kuljetuskerros tarjoaa sovelluksille päästä-päähän -tiedonsiirtopalveluita (*end-to-end*). Näitä ovat esimerkiksi yhteydellinen viestintä, luotettavuus, virran hallinta ja multipleksaus.\n\nTunnetuin tämän tason protokollista on Transmission Control Protocol (TCP). Tätä protokollaa käytetään yhteydellisessä datan lähetyksessä, kun taas yhteydetön User Datagram Protocol (UDP) sopii yksinkertaisten viestien lähettämiseen ilman perillemenon takuuta. TCP on monimutkaisempi mutta luotettavampi protokolla.\n\nYhdessä nämä kaksi protokollaa hoitavat suurimman osan Internetin tiedonsiirrosta ja ovat ainoat protokollat jotka lähes kaikki käyttöjärjestelmät sisältävät. HTTP/3:n siirtoprotokollana käyttämä QUIC on saamassa sijaa uutena merkittävänä siirtotason protokollana."},{"id":"multiplexing","english":"Multiplexing","englishLink":"https://en.wikipedia.org/wiki/Multiplexing","finnishLink":"https://fi.wikipedia.org/wiki/Multipleksaus","finnish":"Multipleksaus","definition":"Multipleksaus (*muxing*) on menetelmä jossa usea analoginen tai digitaalinen signaali yhdistetään yhdeksi, jaettuun siirtovälineeseen lähettämistä varten.\n\nTavoitteena on jakaa yhteistä rajallista resurssia - fyysistä tiedonsiirtokanavaa. Esimerkkinä lankapuhelimet, jossa useaa puhelua voidaan välittää yhtäaikaa yhden kaapelin kautta.\n\nMultipleksaamisessa siirtovälineen kapasiteetti jaetaan useisiin loogisiin kanaviin, yksi kutakin lähetettävää signaalia tai datavirtaa varten. Vastaanottavassa päässä käänteisesti (*demultiplexing*) erotellaan loogiset kanavat siirtovälineestä ja poimitaan kunkin kanavan signaalit tai data ja käsitellään ne erikseen."},{"id":"internet_layer","english":"Internet layer","englishLink":"https://en.wikipedia.org/wiki/Internet_layer","finnishLink":"https://fi.wikipedia.org/wiki/TCP/IP-viitemalli#Verkkokerros_(Internet_Layer)","finnish":"Verkkotaso","definition":"Verkkotaso koostuu joukosta protokollia, menetetelmiä ja määrityksiä jotka mahdollistavat pakettien siirron isäntäkoneelta toiselle useiden verkkojen yli IP-osoitteita käyttäen. Verkot yhdistyvät toisiinsa yhdyskäytävien (*gateway*) kautta.\n\nTärkein protokolla tällä tasolla on Internet Protocol (IP), josta on kaksi versiota, IPv4 ja IPv6. Tällä tasolla 1) uloslähteville paketeille valitaan sopiva yhdyskäytävä jonka kautta paketti välitetään eteenpäin seuraavaan verkkoon, 2) sisääntulevat paketit käsitellään ja välitetään paketti tarpeen mukaan ylemmälle siirtotasolle käsittelyä varten ja 3) tarjotaan keinoja virheiden havaitsemiseksi ja diagnoisoimiseksi. Viimeksi mainitussa Internet Control Message Protocol (ICMP) on tärkeässä roolissa.\n\nVerkkotaso -nimitys vastaa ISO/OSI -mallissa *network layer* -tasoa. Internet -protokollapinosta puhuttaessa verkkotasosta käytetään yleisemmin nimitystä *Internet layer*."},{"id":"link_layer","english":"Link layer","englishLink":"https://en.wikipedia.org/wiki/Link_layer","finnishLink":"https://fi.wikipedia.org/wiki/TCP/IP-viitemalli#Peruskerros_(Link_Layer)","finnish":"Linkkitaso","definition":"Linkkitaso on Internet -protokollapinon alin taso. Linkkitaso muodostuu joukosta menetelmiä ja protokollia jotka määrittelevät miten laite viestii siihen kytketyn fyysisen linkin eli siirtotien kautta.\n\nLinkki on ne fyysiset ja loogiset verkon komponentit jotka yhdistävät isäntäkoneen tai solmun (*node*) seuraavaan solmuun verkossa. IP ei rajaa eikä määrittele sitä miten linkkitaso toteutetaan, vaan olettaa ainoastaan että linkkitaso tarjoaa tarvittavat palvelut joiden avulla paketit siirtyvät solmusta seuraavaan.\n\nLinkkitason protokollia ovat esimerkiksi Ethernet, ADSL, langattomat verkot kuten Wi-Fi ja 4G, sekä Point-to-Point Protocol (PPP). Tärkeä protokolla on myös Address Resolution Protocol (ARP), jonka avulla voidaan löytää laitteen fyysinen osoite (usein MAC-osoite) jolla on tietty IP-osoite."},{"id":"network_topology","english":"Network topology","englishLink":"https://en.wikipedia.org/wiki/Network_topology","finnishLink":"https://fi.wikipedia.org/wiki/Verkkotopologia","finnish":"Verkkotopologia","definition":"Verkkotopologia kuvaa verkon elementtien (solmut, linkit, jne.) organisoinnin rakenteen.\n\nTopologia voi kuvata verkon fyysistä tai loogista rakennetta. Fyysinen topologia kuvaa verkon laitteiden sijoittumisen ja niiden kytkennät toisiinsa. Looginen topologia kuvaa sitä miten data siirtyy verkossa solmusta toiseen. Kahdella eri verkolla voi olla sama looginen topologia, vaikka niiden fyysinen topologia eroaisi toisistaan selkeästi.\n\nVerkoilla voi olla erilaisia topologioita riippuen käytetyistä teknologioista ja verkon suunnittelusta. Yleisiä topologioita ovat esimerkiksi rengas, väylä, tähti tai ns. mesh."},{"id":"end_to_end_principle","english":"End-to-end principle","englishLink":"https://en.wikipedia.org/wiki/End-to-end_principle","finnishLink":"","finnish":"Päästä-päähän -periaate","definition":"Päästä-päähän -periaatteen mukaan verkko on vastuussa ainoastaan siitä että se tekee parhaansa toimittaessaan paketteja verkon yli.\n\nJos sovellukset tarvitsevat ominaisuuksia kuten luotettavuus (*reliability*) tai tietoturvallisuus (*security*), nämä asiat täytyy hoitaa mekanismeilla ja protokollilla jotka sijaitsevat yhteyden päissä eli isäntäkoneissa. Verkon laitteet ja/tai protokollat eivät siis takaa varmaa pakettien toimitusta ja tietoturvallisuutta."},{"id":"net_neutrality","english":"Net neutrality","englishLink":"https://en.wikipedia.org/wiki/Net_neutrality","finnishLink":"https://fi.wikipedia.org/wiki/Nettineutraliteetti","finnish":"Nettineutraliteetti","definition":"Nettineutraliteetti on periaate, jonka mukaan Internet -palveluntarjoajien (ISP) täytyy kohdella kaikkea nettiliikennettä samanarvoisesti.\n\nISP:t eivät tämän mukaan saa veloittaa verkon käytöstä eri tavoin riippuen sisällöstä, webbisivustosta, alustasta (*platform*), sovelluksista, laitteiden tyypistä, lähde tai kohdeosoitteesta tai tietoliikenteen menetelmistä. ISP:t eivät saa nettineutraliteettiperiaatteen mukaan priorisoida tai rajoittaa jotain tiettyä liikennettä.\n\nPäästä-päähän -periaate ja nettineutraliteetti käsitteinä liittyvät toisiinsa."},{"id":"process","english":"Process (in host)","englishLink":"https://en.wikipedia.org/wiki/Process_(computing)","finnishLink":"https://fi.wikipedia.org/wiki/Prosessi_(tietotekniikka)","finnish":"Prosessi (isäntäkone)","definition":"Prosessi on ohjelma jota tietokoneessa (isäntäkone) suoritetaan. Prosessi sisältää suoritettavan ohjelmakoodin ja sen tilan ja toiminnan.\n\nProsessit isäntäkoneissa viestivät toistensa kanssa verkon yli käyttäen yleensä sovellustason tai siirtotason protokollia. Näin tietysti vain jos ohjelma hyödyntää verkon yli hajauttamista eli käyttää muiden isäntäkoneiden resursseja verkon kautta. Prosessi voi olla tällöin esimerkiksi asiakas-palvelinarkkitehtuurin asiakasohjelma tai palvelinsovellus.\n\nOli prosessin käyttämä protokolla mikä hyvänsä, tiedonsiirrossa käytetään joka tapauksessa viime kädessä pistoketta (*socket*), joka voi olla TCP tai UDP -pistoke."},{"id":"socket","english":"Network socket","englishLink":"https://en.wikipedia.org/wiki/Network_socket","finnishLink":"https://fi.wikipedia.org/wiki/Pistoke_(tietotekniikka)","finnish":"Pistoke","definition":"Pistoke on ohjelmallinen rakenne verkossa olevan solmun käynnissä olevassa ohjelmassa (*process*). Pistoke toimii päätepisteenä datan lähettämiselle ja vastaanottamiselle verkon yli.\n\nMinkälainen pistoke on, riippuu käytetystä ohjelmointirajapinnasta (Application Programming Interface, API) ja ohjelmointikielestä. Ohjelma eli prosessi luo tarvitsemansa pistokkeet käynnissä ollessaan ja sulkee ne kun niitä ei enää tarvita.\n\nPistokkeella on osoite, joka muodostuu käytetystä protokollasta, isäntäkoneen IP -osoitteesta ja portista (*port*) jota kautta pistoke lähettää ja vastaanottaa dataa."},{"id":"http","english":"Hypertext transfer protocol (HTTP)","englishLink":"https://en.wikipedia.org/wiki/Hypertext_Transfer_Protocol","finnishLink":"https://fi.wikipedia.org/wiki/HTTP","finnish":"HTTP","definition":"Hypertekstin siirtoprotokolla (HTTP) on Internetin sovellustason protokolla, yksi niistä tärkeimmistä. Sen avulla voidaan rakentaa hajautettuja hypermediaan (teksti, kuva, ääni, video,...) pohjautuvia tietojärjestelmiä.\n\nHTTP on WWW:n (World Wide Web) tärkeimpiä protokollia. WWW pohjautuu HTML:llä ja muilla webbiteknologioilla rakennettuihin hypertekstidokumentteihin jotka sisältävät linkkejä toisiin hypertekstidokumentteihin ja objekteihin. HTTP ei kuitenkaan ole sama asia kuin HTML tai \"webbisivu\" tai nettiselain. Nettiselaimet käyttävät HTTP:tä tiedonsiirtoon, mutta on mahdollista rakentaa minkälaisia tahansa hajautettuja sovelluksia HTTP:n avulla.\n\nHTTP:stä on useampia versioita, joista HTTP/1 ja HTTP/2 on rakennettu TCP:n päälle. Uusin HTTP/3 taas rakentuu uuden QUIC -protokollan päälle (joka taas perustuu UDP:hen). HTTP:stä on olemassa myös tietoturvallisempi versio HTTPS, jonka käyttö on aina suositeltavampaa kuin HTTP:n."},{"id":"url","english":"Uniform Resource Locator (URL)","englishLink":"https://en.wikipedia.org/wiki/URL","finnishLink":"https://fi.wikipedia.org/wiki/URI","finnish":"URL","definition":"URL jota arkikielessä kutsutaan webbiosoitteeksi, on viittaus verkossa olevaan resurssiin joka määrittelee sen sijainnin tietoverkossa, ja mekanismin jolla resurssi voidaan hakea.\n\nURL on eräänlainen URI (*Uniform Resource Identifier*), jolla voidaan tunnistaa resurssi kertomatta välttämättä sijaintia josta se voidaan hakea. Yleensä URL:eja käytetään HTTP -protokollan kanssa webbisivujen (hypertekstidokumentti) hakemiseen, mutta URL:eja voidaan käyttää muidenkin protokollien kanssa, esimerkiksi tiedostojen siirtoon FTP:llä, sähköpostin lähettämiseen mailto:lla ja tietokantojen osoitteen kertomiseen (JDBC tai ODBC), ja niin edelleen.\n\nEsimerkki URL:stä on vaikkapa `https://fi.wikipedia.org/wiki/URI`, jossa skeema (*scheme*) `https` ilmaisee protokollan, `fi.wikipedia.org` ilmaiseen isäntäkoneen nimen (*host name*), `wiki` ilmaisee polun (*path*) ja `URI` kertoo webbisivun joka halutaan hakea."},{"id":"request-response","english":"Request-response","englishLink":"https://en.wikipedia.org/wiki/Request–response","finnishLink":"https://fi.wikipedia.org/wiki/HTTP#Pyyntö","finnish":"Pyyntö-vastaus","definition":"Pyyntö-vastaus on yksikertainen tapa jolla tietokoneet voivat viestiä keskenään tietoverkon yli.\n\nToinen isäntäkoneista lähettää ensin pyynnön, johon toinen isäntäkone vastaa. Tämä yksinkertainen mutta tehokas tapa rakentaa hajautettuja järjestelmiä mahdollistaa kahdensuuntaisen viestinnän kanavan kautta. Tätä käytetään erityisesti asiakas-palvelin -arkkitehtuureissa, joissa asiakas on lähes aina pyynnön lähettävä osapuoli. Esimerkkinä webbiselain joka lähettää HTTP GET -pyynnön webbiserverille, joka vastaa HTML-sivulla asiakkaan pyyntöön.\n\nYksinkertaisimmillaan tämä on *synkronista* tiedonsiirtoa: asiakas jää odottamaan vastausta eikä tee odottaessa mitään. Toisena esimerkkinä *asynkroninen* pyyntö-vastaus, jossa asiakas lähettää pyynnön ja jatkaa muiden tehtävien parissa, kunnes vastapuoli lähettää vastauksen joka käsitellään sitten myöhemmin."},{"id":"payload","english":"Payload","englishLink":"https://en.wikipedia.org/wiki/Payload_(computing)","finnishLink":"","finnish":"Tietosisältö","definition":"Tietoliikenteessä, varsinainen lähetettävä data eli viestin tietosisältö, erotuksena eri Internet -protokollapinon tasoilla olevien protokollien lisäämiin otsikkotietoihin (*header*, *footer*) joita tarvitaan viestin välittämisessä.\n\nKun tiedon siirrossa käytetään esimerkiksi JSON:ia tai XML:ää, tällöin \"hyötykuorma\" eli sisältö on varsinainen sovelluksen tarvitsema tieto erotuksena kyseisten tiedonkuvauskielten muista elementeista. Esimerkiksi säätietoa sisältävä JSON -rakenne: `{ \"tempnow\" : 16.0 }` sisältää aaltosulkuja ja tietoelementtien nimiä, kun varsinainen kiinnostava tieto (*payload*) on lämpötila 16.0 astetta celsiusta."},{"id":"cache_network","english":"Cache (network)","englishLink":"","finnishLink":"","finnish":"Välimuisti (tietoverkko)","definition":"Tietoverkkojen yhteydessä välimuisti tarkoittaa sekä isäntäkoneilla että verkossa olevilla muilla isäntäkoneilla olevia tallennuspaikkoja joiden tarkoituksena on usein välttää turhien verkkopyyntöjen tekemistä. Tämä nopeuttaa tiedonsaantia ja vähentää verkon ja palvelimien kuormitusta.\n\nEsimerkkinä DNS -välimuistit: käyttäjän tietokoneessa verkkoselain voi pitää muistissa vasta saatujen isäntäkoneiden IP-osoitteita jottei niitä tarvitsisi hakea verkosta. Myös tietokoneen käyttöjärjestelmä voi tehdä samoin. Käyttäjän verkko-operaattori (ISP) voi myös ylläpitää tietoja isäntäkoneiden nimistä ja IP-osoitteista, jotta niitä ei tarvitsisi hakea varsinaisilta Internetin DNS -palvelimilta.\n\nToinen esimerkki välimuisteista on ns. web proxy -palvelin. Tällainen kone voi pitää muistissa harvoin muuttuvaa webbisisältöä, kuten kuvatiedostot tai staattiset HTML -sivut. Kun käyttäjä tekee HTTP -pyynnön tietokoneellaan, kuvat ja muuttumaton HTML-sisältö haetaan lähellä olevasta proxy -palvelimesta, mutta muuttuva sisältö varsinaiselta palvelimelta. Tällaisia välimuisteja voi olla myös käyttäjän omalla tietokoneella."},{"id":"cookie","english":"Cookie","englishLink":"https://en.wikipedia.org/wiki/HTTP_cookie","finnishLink":"https://fi.wikipedia.org/wiki/Eväste","finnish":"Eväste, keksi","definition":"Evästeet, joita käytetään HTTP -protokollan kanssa, ovat pieniä palvelimen luomia tietoelementtejä joita verkkoselain tallentaa käyttäjän laitteelle.\n\nEvästeet voivat sisältää verkkopalvelun käytön kannalta olennaista tietoa. Evästeiden avulla voidaan tallentaa olennaista tilatietoa esimerkiksi verkkokaupassa tehdyistä valinnoista, käyttäjästä ja käyttäjän tunnistautumisesta, tai seurata käyttäjän etenemistä palvelussa ja palveluista toisiin. Palvelu ei siis voi välttämättä toimia ilman evästeitä. Eväste voi sisältää myös käyttäjän antamaa tietoa, kuten nimi, osoite, salasana tai maksukortin numero.\n\nEvästeiden käyttö voi olla myös haitallista. Esimerkiksi ihmisten toimien seuraaminen verkossa keksien avulla on yksityisyyden kannalta asia jota käyttäjä ei välttämättä halua hyväksyä."},{"id":"firewall","english":"Firewall","englishLink":"https://en.wikipedia.org/wiki/Firewall_(computing)","finnishLink":"https://fi.wikipedia.org/wiki/Palomuuri","finnish":"Palomuuri","definition":"Palomuuri on verkon tietoturvaa ylläpitävä järjestelmä joka tarkkailee ja hallitsee verkkoon sisääntulevaa ja sieltä uloslähtevää liikennettä. Apuna tässä käytetään valmiiksi annettuja ja käyttäjän muokattavissa olevia sääntöjä.\n\nTyypillisesti palomuuri asetetaan luotetun verkon rajalle. Esimerkiksi kotiverkossa verkkolaite (esim. Wi-Fi -reititin), joka yhdistää kotiverkon verkko-operaattorin verkkoon, sisältää usein myös palomuurin.\n\nMyös yksittäisen tietokoneen eli isäntäkoneen (*host*) käyttöjärjestelmä voi sisältää palomuuriohjelmiston tai sellaisen voi asentaa erikseen."},{"id":"port","english":"Port","englishLink":"https://en.wikipedia.org/wiki/Port_(computer_networking)","finnishLink":"https://fi.wikipedia.org/wiki/Portti_(tietoliikenne)","finnish":"Portti","definition":"Tietoliikenteessä portti on numero, jolla voidaan tunnistaa yhteyden pää (*palvelupiste*) yhdessä isäntäkoneen IP -osoitteen kanssa. Esimerkiksi osoite `123.123.123.123:12345` kertoo että prosessin osoite muodostuu isäntäkoneen IP-osoitteesta `123.123.123.123` ja porttinumerosta `12345`.\n\nNäin prosessit eli ohjelmat samassa tietokoneessa voidaan tunnistaa yksikäsitteisesti isäntäkoneen IP-osoitteen ja prosessin käyttämän portin numeron avulla.\n\nProsessille tuleva data ohjataan multipleksaamisen (*multiplexing*) avulla tietokoneessa portin numeron perustella sille prosessille jolla tämä portti on käytössä. Yhdellä prosessilla voi olla useampikin yhteys, jolloin näillä kaikilla yhteyksillä on oma porttinumeronsa. Tietyt porttinumerot on varattu tiettyyn tarkoitukseen (*well-known port numbers*)."},{"id":"octet","english":"Octet","englishLink":"https://en.wikipedia.org/wiki/Octet_(computing)","finnishLink":"https://fi.wikipedia.org/wiki/Tavu_(tietotekniikka)","finnish":"Oktetti","definition":"Oktetti on digitaalisen tiedon ja tietoliikenteen yksikkö, joka koostuu kahdeksasta bitistä (bit).\n\nTermiä oktetti käytetään jos tavu -termi voi olla epämääräinen. Tämä johtuu siitä että tavu ei aina ole ollut kahdeksan bitin mittainen vaan sen koko on vaihdellut, riippuen tietokonearkkitehtuurista.\n\nNykyisin oktetti ja tavu ovat synonyymejä, mutta jos ollaan tekemisissä erittäin vanhan mutta silti käytössä olevan teknologian kanssa, voidaan käyttää erikseen termiä oktetti ja tavu jotta on selkeää mistä puhutaan."},{"id":"quic","english":"QUIC","englishLink":"https://en.wikipedia.org/wiki/QUIC","finnishLink":"https://fi.wikipedia.org/wiki/QUIC","finnish":"QUIC","definition":"QUIC on yleiskäyttöinen siirtotason protokolla, joka on suunniteltu 2012, mutta on otettu käyttöön viime vuosien aikana.\n\nQUIC ei ole lyhenne vaan protokollan nimi. Monissä käyttätilanteissa on arkoituksena korvata TCP QUIC:lla. Esimerkiksi HTTP -protollan käyttämänä protokollana, koska se on nopeampi multipleksaamisessa kuin TCP. Siksi sitä usein kutsutaankin lempinimellä \"TCP/2\".\n\nHTTP -protokollan versio 3 (HTTP/3) rakentuu QUIC:n päälle joka taas käyttää UDP:tä tiedonsiirtoon."}]